# 绝对坐标
# 游戏画面坐标(y,x)
game_pos = [[692, 1280], [1540, 2560]]
# 点击坐标(y,x)
click_left_pos = [1000, 1300]
click_right_pos = [1000, 2400]


# 相对坐标(相对于游戏画面内的坐标)
# 蛇的坐标(y,x)
snake_pos = [
    [[570, 487], [570, 802]],
    [[570, 331], [570, 953]],
    [[570, 181], [570, 1112]],
    [[570, 24], [570, 1264]]
]

# fever条位置(y,x)
fever_pos = [710, 760]

# 游戏结束判定位置(可以不用判定, 直接关闭脚本)
end_pos = [565, 681]

# 建议不要修改
# 三条蛇的颜色
green_color = [49, 97, 90]
blue_color = [165, 77, 66]
red_color = [57, 48, 123]
# fever的颜色
fever_color = [57, 81, 255]

#游戏结束判定位置颜色
end_color = [239, 243, 247]